04_Simulation/PH_gen100_pop100_symUK_parIs_first_and_last_profiles/running_pfac150_pop100_seed0/run_04905/PH_2D_RANS_kOmegaSSTx/system/sampleDictU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat csv;

interpolationScheme cellPoint;

fields
(
    U
    k       
);

sets
(

    X0H
    {
        type        face;
        axis        y;

        start       (0.05 0 0);
        end         (0.05 5 0);
    }

    X1H
    {
        type        face;
        axis        y;

        start       (1 0 0);
        end         (1 5 0);
    }

    X2H
    {
        type        face;
        axis        y;

        start       (2 0 0);
        end         (2 5 0);
    }

    X4H
    {
        type        face;
        axis        y;

        start       (4 0 0);
        end         (4 5 0);
    }

    X6H
    {
        type        face;
        axis        y;

        start       (6 0 0);
        end         (6 5 0);
    }

    X8H
    {
        type        face;
        axis        y;

        start       (8 0 0);
        end         (8 5 0);
    }
   
);
// *********************************************************************** //
